{
  "nav": {
    "home": "होम",
    "about": "के बारे में",
    "projects": "प्रोजेक्ट",
    "experience": "अनुभव",
    "education": "शिक्षा",
    "contact": "संपर्क"
  },
  "home": {
    "greeting": "नमस्ते, मैं Mitchell Hess हूं",
    "title": "फुल-स्टैक सॉफ्टवेयर इंजीनियर",
    "description": "मैं PepsiCo में डेटा टूल्स और फुल-स्टैक एप्लिकेशन बनाने का काम करता हूं। मुझे यह पता लगाना पसंद है कि चीजों को बेहतर कैसे बनाया जाए, चाहे वह UI में सुधार हो या बैकएंड सिस्टम को तेज बनाना हो।",
    "viewWork": "मेरा काम देखें",
    "getInTouch": "संपर्क करें"
  },
  "about": {
    "title": "मेरे बारे में",
    "paragraph1": "मैं <strong>PepsiCo</strong> में एक <strong>सॉफ्टवेयर इंजीनियर / डेटा साइंटिस्ट</strong> हूं, जहां मैं डेटा क्वालिटी फ्रेमवर्क बनाता हूं और पाइपलाइनों को ऑप्टिमाइज करता हूं ताकि टीमें अधिक कुशलता से काम कर सकें। मेरा ज्यादातर दिन Python और Databricks में बीतता है, जटिल चीजों को सरल बनाने की कोशिश करते हुए।",
    "paragraph2": "जब मैं कोडिंग नहीं कर रहा होता, तो आमतौर पर मैं अपने बैंड <strong>eileen</strong> में गिटार बजा रहा होता हूं, जिम में क्लाइंबिंग कर रहा होता हूं, या Guardians को दिल दहला देने वाले तरीके से हारते हुए देख रहा होता हूं। मैं जिस चीज में उस समय रुचि रखता हूं, उसमें गहराई से जाने की प्रवृत्ति रखता हूं।",
    "technologiesTitle": "मैं जिन तकनीकों के साथ काम करता हूं",
    "whatImInto": "अभी मैं किसमें रुचि रखता हूं",
    "skills": {
      "react": "React & TypeScript",
      "python": "Python & ML",
      "node": "Node.js",
      "aws": "AWS & Docker",
      "postgres": "PostgreSQL",
      "git": "Git & CI/CD"
    }
  },
  "projects": {
    "title": "फीचर्ड प्रोजेक्ट्स",
    "subtitle": "साइड प्रोजेक्ट जहां मैं नई तकनीक के साथ प्रयोग करता हूं और विचारों को जीवन में लाता हूं",
    "applySimple": {
      "name": "ApplySimple",
      "description": "एक आधुनिक फुल-स्टैक जॉब एप्लिकेशन ट्रैकर जिसमें AI-संचालित इनसाइट्स हैं जो आपकी नौकरी खोज रणनीति को अनुकूलित करते हैं। इंटरएक्टिव चार्ट के साथ स्मार्ट एनालिटिक्स डैशबोर्ड, ML-संचालित सफलता की भविष्यवाणियां, पासवर्ड रीसेट के साथ सुरक्षित प्रमाणीकरण, CSV बल्क आयात, और सुंदर डार्क मोड समर्थन शामिल है।",
      "keyFeatures": "मुख्य विशेषताएं और विकास",
      "features": [
        "Next.js 15 (App Router) और React 19 के साथ फुल-स्टैक ऐप बनाया",
        "सफलता की संभावना की भविष्यवाणियों के लिए FastAPI ML माइक्रोसर्विस विकसित की",
        "डेटा प्रबंधन के लिए Prisma ORM के साथ PostgreSQL 16 डेटाबेस डिज़ाइन किया",
        "NextAuth.js के साथ सुरक्षित प्रमाणीकरण लागू किया और Resend के माध्यम से ईमेल पासवर्ड रीसेट",
        "Recharts विज़ुअलाइज़ेशन और ML इनसाइट्स के साथ इंटरएक्टिव एनालिटिक्स डैशबोर्ड बनाया"
      ],
      "techStack": "टेक स्टैक",
      "visitWebsite": "वेबसाइट पर जाएं",
      "viewGithub": "GitHub पर देखें"
    },
    "scoutMaster": {
      "name": "ScoutMaster",
      "description": "एक मोबाइल ऐप जो आपको वास्तविक दुनिया के स्थानों को खोजने और उनकी यात्रा करने में मदद करता है जहां आपकी पसंदीदा फिल्में और टीवी शो फिल्माए गए थे। इंटरएक्टिव मैप का अन्वेषण करें, दिशा-निर्देश प्राप्त करें, और प्रतिष्ठित फिल्मांकन स्थलों के बारे में पर्दे के पीछे के विवरण खोजें।",
      "developmentProcess": "विकास प्रक्रिया",
      "process": [
        "iOS और Android के लिए React Native के साथ क्रॉस-प्लेटफ़ॉर्म मोबाइल ऐप बनाया",
        "इंटरएक्टिव स्थान अन्वेषण के लिए Google Maps API एकीकृत किया",
        "फिल्मांकन स्थानों को प्रबंधित करने के लिए Node.js और MongoDB के साथ REST API डिज़ाइन किया",
        "उपयोगकर्ता खातों और सहेजे गए स्थानों के लिए Firebase Auth लागू किया"
      ],
      "techStack": "टेक स्टैक",
      "visitWebsite": "वेबसाइट पर जाएं",
      "appStore": "App Store"
    },
    "portfolio": {
      "name": "इंटरएक्टिव पोर्टफोलियो",
      "description": "यह पोर्टफोलियो साइट (हां, वही जो आप अभी देख रहे हैं... काफी मेटा, मुझे पता है)। एक कस्टम कर्सर के साथ बनाया गया है जो आपका अनुसरण करता है और एक ग्रेडिएंट प्रभाव जो आपके माउस के साथ चलता है। 10 भाषाओं के लिए बहु-भाषा समर्थन, स्मूद एनिमेशन, डार्क मोड, और लाइव API इंटीग्रेशन शामिल हैं जो Spotify और MLB से डेटा खींचते हैं।",
      "techStackDeployment": "टेक स्टैक और डिप्लॉयमेंट",
      "developmentHighlights": "विकास की मुख्य बातें",
      "highlights": [
        "ब्राउज़र डिटेक्शन और पर्सिस्टेंट प्रेफरेंस के साथ 10 भाषाओं के लिए बहु-भाषा समर्थन (i18n)",
        "होवर इफेक्ट के साथ कस्टम कर्सर (मोबाइल डिवाइस पर छिपा हुआ)",
        "डायनामिक ग्रेडिएंट स्पॉटलाइट जो आपके माउस को ट्रैक करता है",
        "आसान डिप्लॉयमेंट के लिए स्वचालित CI/CD के साथ Dockerized",
        "रियल-टाइम API इंटीग्रेशन जो वर्तमान Spotify प्ले और Cleveland Guardians स्टैट्स दिखाते हैं"
      ],
      "viewGithub": "GitHub पर देखें"
    }
  },
  "experience": {
    "title": "अनुभव",
    "subtitle": "मैंने कहां काम किया है और मैंने क्या बनाया है",
    "positions": [
      {
        "role": "सॉफ्टवेयर इंजीनियर / डेटा साइंटिस्ट",
        "company": "PepsiCo, Inc.",
        "period": "जुलाई 2024 से वर्तमान",
        "logo": "/assets/pepsico_logo.jpg",
        "details": [
          "एक Python फ्रेमवर्क बनाया जो पाइपलाइनों में डेटा क्वालिटी को मान्य करता है, जिसे टीम ने संगति के लिए कंपनी-व्यापी रूप से अपनाया। यह स्वचालित रूप से मुद्दों को फ्लैग करता है और रिपोर्ट उत्पन्न करता है, मैनुअल जांच के घंटों की बचत करता है।",
          "समानांतर त्रुटि पहचान और अनुकूलित रिपोर्टिंग लॉजिक के माध्यम से पाइपलाइन दक्षता में 30% की वृद्धि की, पीक अवधि के दौरान डेटा प्रोसेसिंग को काफी तेज बनाया।",
          "स्केलेबल Azure और Docker डिप्लॉयमेंट प्रदान करने के लिए इंजीनियरिंग और DevOps टीमों के साथ सहयोग किया, प्लेटफ़ॉर्म भर में सिस्टम अपटाइम और डेटा विश्वसनीयता को बढ़ावा दिया।",
          "बाजार हिस्सेदारी और अन्य महत्वपूर्ण मेट्रिक्स पर प्रमुख अंतर्दृष्टि को सामने लाने वाली नई सुविधाओं को विकसित करने के लिए व्यावसायिक टीमों के साथ निकटता से काम किया, हितधारकों को डेटा-संचालित निर्णय लेने में मदद की।"
        ]
      },
      {
        "role": "डेटा साइंटिस्ट इंटर्न",
        "company": "PepsiCo, Inc.",
        "period": "मई 2023 से अगस्त 2023",
        "details": [
          "ML मॉडल बनाए जो मांग पैटर्न की भविष्यवाणी करते हैं और समस्याएं पैदा करने से पहले ETL मुद्दों को पकड़ते हैं। इसने इंजीनियरों द्वारा डीबगिंग में बिताए गए समय को लगभग 40% कम कर दिया।",
          "स्वचालित डैशबोर्ड सेट अप किए जो डेटा क्वालिटी मेट्रिक्स और पूर्वानुमानों को विज़ुअलाइज़ करते हैं, टीम के लिए ट्रेंड और विसंगतियों को एक नज़र में देखना आसान बनाते हैं।"
        ],
        "logo": "/assets/pepsico_logo.jpg"
      },
      {
        "role": "सॉफ्टवेयर डेवलपमेंट इंटर्न",
        "company": "Good Faith Energy",
        "period": "मई 2022 से अगस्त 2022",
        "details": [
          "Svelte, Node.js, और PostgreSQL का उपयोग करके एक सोलर प्राइसिंग टूल विकसित किया जो ग्राहक इनपुट और वर्तमान मूल्य निर्धारण डेटा के आधार पर वास्तविक समय उद्धरण उत्पन्न करता है।",
          "एक रिस्पॉन्सिव इंटरफ़ेस बनाकर कोटिंग वर्कफ़्लो को सुव्यवस्थित किया जिसने जनरेशन समय को 20% कम किया, सेल्स टीम को तेजी से सौदे बंद करने में मदद की।"
        ],
        "logo": "/assets/good_faith_energy_logo.jpg"
      }
    ]
  },
  "education": {
    "title": "शिक्षा",
    "subtitle": "कंप्यूटर साइंस और सॉफ्टवेयर इंजीनियरिंग में शैक्षणिक नींव",
    "degrees": [
      {
        "degree": "M.S. कंप्यूटर साइंस",
        "school": "यूनिवर्सिटी ऑफ नॉर्थ टेक्सास",
        "date": "अपेक्षित मई 2026",
        "logo": "/assets/northtexas_logo.jpg",
        "bullets": [
          "हाइलाइट किए गए पाठ्यक्रम: AI के लिए सॉफ्टवेयर विकास, सॉफ्टवेयर इंजीनियरिंग में उपयोगिता परीक्षण, कंप्यूटर एल्गोरिदम का विश्लेषण",
          "GPA: 4.0"
        ]
      },
      {
        "degree": "B.S. कंप्यूटर साइंस",
        "school": "यूनिवर्सिटी ऑफ नॉर्थ टेक्सास",
        "date": "मई 2024",
        "bullets": [
          "गणित में माइनर",
          "CSCE अंडरग्रेजुएट साइबर सिक्योरिटी सर्टिफिकेट से सम्मानित",
          "गिटार क्लब के सदस्य",
          "मैग्ना कम लाउड"
        ],
        "logo": "/assets/northtexas_logo.jpg"
      }
    ]
  },
  "widgets": {
    "music": {
      "title": "मुझे पसंद संगीत",
      "subtitle": "विशेषता कलाकार",
      "live": "लाइव",
      "listenSpotify": "Spotify पर सुनें",
      "progressiveRock": "प्रोग्रेसिव रॉक के दिग्गज",
      "checkOut": "हमारा संगीत सुनें!",
      "favoriteArtist": "पसंदीदा कलाकार",
      "myBand": "मेरा बैंड",
      "monthlyListeners": "अनुयायी",
      "lastUpdated": "अपडेट किया गया"
    },
    "guardians": {
      "unableToLoad": "खेल लोड करने में असमर्थ",
      "checkBackLater": "बाद में वापस आएं!",
      "recentAndUpcoming": "हाल के और आगामी खेल",
      "live": "लाइव",
      "seasonRecord": "2024 सीज़न रिकॉर्ड",
      "division": "डिवीजन",
      "alCentral": "एएल सेंट्रल",
      "offSeason": "ऑफ-सीज़न - कोई खेल निर्धारित नहीं",
      "checkBackSeason": "बेसबॉल सीज़न के दौरान वापस आएं!",
      "go": "चलो",
      "guards": "गार्ड्स!"
    }
  },
  "contact": {
    "title": "आइए मिलकर काम करें",
    "subtitle": "नए अवसरों और दिलचस्प परियोजनाओं के लिए खुला। संपर्क करने में संकोच न करें!",
    "methods": {
      "email": {
        "name": "ईमेल",
        "label": "mitchell.hess@outlook.com"
      },
      "linkedin": {
        "name": "LinkedIn",
        "label": "linkedin.com/in/mitchell-hess"
      },
      "github": {
        "name": "GitHub",
        "label": "github.com/Mitchell-Hess"
      }
    },
    "connect": "कनेक्ट करें",
    "footer": "© 2025 Mitchell Hess। React, TypeScript, और Tailwind CSS के साथ निर्मित।"
  }
}