{
  "nav": {
    "home": "главная",
    "about": "обо мне",
    "projects": "проекты",
    "experience": "опыт",
    "education": "образование",
    "contact": "контакты"
  },
  "home": {
    "greeting": "Привет, я Mitchell Hess",
    "title": "Full-Stack Инженер-программист",
    "description": "Я работаю в PepsiCo, создавая инструменты для работы с данными и full-stack приложения. Мне нравится выяснять, как сделать так, чтобы вещи работали лучше, будь то улучшение UI или ускорение backend-систем.",
    "viewWork": "Посмотреть Мои Работы",
    "getInTouch": "Связаться"
  },
  "about": {
    "title": "Обо Мне",
    "paragraph1": "Я <strong>Инженер-программист / Специалист по данным</strong> в <strong>PepsiCo</strong>, где я создаю фреймворки для контроля качества данных и оптимизирую конвейеры, чтобы помочь командам работать более эффективно. Большую часть дня я провожу в Python и Databricks, пытаясь упростить сложные вещи.",
    "paragraph2": "Когда я не программирую, я обычно играю на гитаре в своей группе <strong>eileen</strong>, занимаюсь скалолазанием в зале или смотрю, как Guardians проигрывают душераздирающим образом. Я склонен глубоко погружаться в то, что меня интересует в данный момент.",
    "technologiesTitle": "Технологии, с которыми я работаю",
    "whatImInto": "Чем Я Увлекаюсь Сейчас",
    "skills": {
      "react": "React & TypeScript",
      "python": "Python & ML",
      "node": "Node.js",
      "aws": "AWS & Docker",
      "postgres": "PostgreSQL",
      "git": "Git & CI/CD"
    }
  },
  "projects": {
    "title": "Избранные Проекты",
    "subtitle": "Побочные проекты, где я экспериментирую с новыми технологиями и воплощаю идеи в жизнь",
    "applySimple": {
      "name": "ApplySimple",
      "description": "Современный full-stack трекер заявок на работу с инсайтами на основе ИИ для оптимизации вашей стратегии поиска работы. Включает интеллектуальные аналитические панели с интерактивными графиками, прогнозы успеха на основе ML, безопасную аутентификацию со сбросом пароля, массовый импорт CSV и красивую поддержку темного режима.",
      "keyFeatures": "Ключевые Функции и Разработка",
      "features": [
        "Full-stack приложение, созданное с Next.js 15 (App Router) и React 19",
        "Разработан микросервис ML с FastAPI для прогнозирования вероятности успеха",
        "Спроектирована база данных PostgreSQL 16 с Prisma ORM для управления данными",
        "Реализована безопасная аутентификация с NextAuth.js и сброс пароля по email через Resend",
        "Создана интерактивная аналитическая панель с визуализациями Recharts и инсайтами ML"
      ],
      "techStack": "Технологический Стек",
      "visitWebsite": "Посетить Сайт",
      "viewGithub": "Посмотреть на GitHub"
    },
    "scoutMaster": {
      "name": "ScoutMaster",
      "description": "Мобильное приложение, которое помогает найти и посетить реальные места, где снимались ваши любимые фильмы и телешоу. Исследуйте интерактивные карты, получайте маршруты и узнавайте закулисные детали об культовых местах съемок.",
      "developmentProcess": "Процесс Разработки",
      "process": [
        "Кроссплатформенное мобильное приложение, созданное с React Native для iOS и Android",
        "Интегрирован Google Maps API для интерактивного изучения локаций",
        "Спроектирован REST API с Node.js и MongoDB для управления местами съемок",
        "Реализован Firebase Auth для учетных записей пользователей и сохраненных мест"
      ],
      "techStack": "Технологический Стек",
      "visitWebsite": "Посетить Сайт",
      "appStore": "App Store"
    },
    "portfolio": {
      "name": "Интерактивное Портфолио",
      "description": "Этот сайт-портфолио (да, тот самый, на который вы сейчас смотрите... довольно мета, я знаю). Создан с пользовательским курсором, который следует за вами, и градиентным эффектом, который движется с вашей мышью. Включает плавные анимации, поддержку темного режима и live API интеграции, извлекающие данные из Spotify и MLB.",
      "techStackDeployment": "Технологический Стек и Развертывание",
      "developmentHighlights": "Основные Моменты Разработки",
      "highlights": [
        "Пользовательский курсор с эффектами наведения (скрывается на мобильных устройствах)",
        "Динамический градиентный прожектор, который отслеживает вашу мышь",
        "Dockerized с автоматизированным CI/CD для легкого развертывания",
        "Интеграции API в реальном времени, показывающие текущие воспроизведения Spotify и статистику Cleveland Guardians"
      ],
      "viewGithub": "Посмотреть на GitHub"
    }
  },
  "experience": {
    "title": "Опыт",
    "subtitle": "Где я работал и что я создал",
    "positions": [
      {
        "role": "Инженер-программист / Специалист по данным",
        "company": "PepsiCo, Inc.",
        "period": "Июль 2024 по настоящее время",
        "logo": "/assets/pepsico_logo.jpg",
        "details": [
          "Создал фреймворк Python, который проверяет качество данных в конвейерах, который команда приняла на уровне всей компании для обеспечения согласованности. Он автоматически отмечает проблемы и генерирует отчеты, экономя часы ручных проверок.",
          "Повысил эффективность конвейера на 30% благодаря параллельному обнаружению ошибок и оптимизированной логике отчетности, сделав обработку данных значительно быстрее в периоды пиковой нагрузки.",
          "Сотрудничал с командами инженеров и DevOps для масштабируемых развертываний Azure и Docker, повышая время безотказной работы системы и надежность данных на всей платформе.",
          "Тесно работал с бизнес-командами для разработки новых функций, которые предоставляют ключевые инсайты по доле рынка и другим критическим метрикам, помогая заинтересованным сторонам принимать решения на основе данных."
        ]
      },
      {
        "role": "Стажер-специалист по данным",
        "company": "PepsiCo, Inc.",
        "period": "Май 2023 по Август 2023",
        "details": [
          "Создал модели ML, которые прогнозируют паттерны спроса и обнаруживают проблемы ETL до того, как они вызовут проблемы. Это сократило время, которое инженеры тратили на отладку, примерно на 40%.",
          "Настроил автоматизированные панели, которые визуализируют метрики качества данных и прогнозы, облегчая команде обнаружение трендов и аномалий с первого взгляда."
        ],
        "logo": "/assets/pepsico_logo.jpg"
      },
      {
        "role": "Стажер по разработке программного обеспечения",
        "company": "Good Faith Energy",
        "period": "Май 2022 по Август 2022",
        "details": [
          "Разработал инструмент ценообразования на солнечную энергию, используя Svelte, Node.js и PostgreSQL, который генерирует котировки в реальном времени на основе входных данных клиента и текущих данных о ценах.",
          "Оптимизировал рабочий процесс котировок, создав отзывчивый интерфейс, который сократил время генерации на 20%, помогая отделу продаж быстрее заключать сделки."
        ],
        "logo": "/assets/good_faith_energy_logo.jpg"
      }
    ]
  },
  "education": {
    "title": "Образование",
    "subtitle": "Академическая основа в области компьютерных наук и разработки программного обеспечения",
    "degrees": [
      {
        "degree": "M.S. Компьютерные Науки",
        "school": "Университет Северного Техаса",
        "date": "Ожидается Май 2026",
        "logo": "/assets/northtexas_logo.jpg",
        "bullets": [
          "Выделенные курсы: Разработка ПО для ИИ, Тестирование Юзабилити в Разработке ПО, Анализ Компьютерных Алгоритмов",
          "GPA: 4.0"
        ]
      },
      {
        "degree": "B.S. Компьютерные Науки",
        "school": "Университет Северного Техаса",
        "date": "Май 2024",
        "bullets": [
          "Специализация по Математике",
          "Присвоен сертификат CSCE по кибербезопасности для студентов",
          "Член Гитарного Клуба",
          "Magna Cum Laude"
        ],
        "logo": "/assets/northtexas_logo.jpg"
      }
    ]
  },
  "widgets": {
    "music": {
      "title": "Музыка, которая мне нравится",
      "subtitle": "Избранные артисты",
      "live": "Прямой эфир",
      "listenSpotify": "Слушать на Spotify",
      "progressiveRock": "Легенды прогрессивного рока",
      "checkOut": "Слушайте нашу музыку!",
      "favoriteArtist": "Любимый артист",
      "myBand": "Моя группа",
      "monthlyListeners": "подписчиков",
      "lastUpdated": "Обновлено"
    },
    "guardians": {
      "unableToLoad": "Не удалось загрузить игры",
      "checkBackLater": "Зайдите позже!",
      "recentAndUpcoming": "Недавние и предстоящие игры",
      "live": "Прямой эфир",
      "seasonRecord": "Рекорд сезона 2024",
      "division": "Дивизион",
      "alCentral": "Центральный AL",
      "offSeason": "Межсезонье - Игры не запланированы",
      "checkBackSeason": "Зайдите во время бейсбольного сезона!",
      "go": "Вперед",
      "guards": "Гардс!"
    }
  },
  "contact": {
    "title": "Давайте Работать Вместе",
    "subtitle": "Открыт для новых возможностей и интересных проектов. Не стесняйтесь обращаться!",
    "methods": {
      "email": {
        "name": "Email",
        "label": "mitchell.hess@outlook.com"
      },
      "linkedin": {
        "name": "LinkedIn",
        "label": "linkedin.com/in/mitchell-hess"
      },
      "github": {
        "name": "GitHub",
        "label": "github.com/Mitchell-Hess"
      }
    },
    "connect": "Связаться",
    "footer": "© 2025 Mitchell Hess. Создано с React, TypeScript и Tailwind CSS."
  }
}